app/controllers/comments_controller.rb

  def create
    @event = Event.find(params[:event_id])
    @comment = @event.comments.build(params[:comment])
    @comment.user = current_user
    if @comment.save
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
INSERT INTO "comments" ("event_id", "updated_at", "body", "commenter", "user_id", "created_at") VALUES(8, '2010-02-25 07:01:48', 'dsgsg', 'ceg', NULL, '2010-02-25 07:01:48')

  def destroy
    @event = Event.find(params[:event_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 2)
DELETE FROM "comments" WHERE "id" = 2