app/controllers/events_controller.rb

  def create
    @event = current_user.events.new(params[:event])
    if @event.save
---
INSERT INTO "events" ("where", "updated_at", "approved", "speaker_id", "description", "what", "when", "created_at") VALUES('Nosker Lobby', '2010-02-24 22:18:13', 't', 0, 'Hands on TDD training, attendees will be building a full featured rails app.', 'TDD Workshop', '2010-03-02', '2010-02-24 22:18:13')

  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 10)
UPDATE "events" SET "description" = 'This is a TDD training session where we will be building a complete app with full test coverage. Bring your testing hat.

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 3)
DELETE FROM "events" WHERE "id" = 3

  def approve
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)