app/controllers/users_controller.rb

  def check_avaliability
    result = User.find_by_email(params[:user_email]).nil?
---
SELECT * FROM "users" WHERE ("users"."email" = 'admin@test.com') LIMIT 1